<template>
  <bm-card class="lg:w-dialog-sm lg:h-dialog-sm overflow-y-auto p-md col">
    <bm-card class="indent-3">
      蓝芒科技及其关联公司（合称为“我们”）致力于保护及尊重您的隐私。本隐私政策声明仅适用于位于中华人民共和国境内（不含香港特别行政区、澳门特别行政区、台湾地区）且年满18周岁的
      用户。本隐私政策载列了我们处理您向我们提供的任何个人信息，请仔细阅读以下内容，以便了解我们将如何处理您的个人信息。您向我们提供个人信息或对本隐私政策勾选同意，即表示您承认及
      认可本隐私政策所述的条款。
    </bm-card>
    <bm-card class="indent-3">
      本隐私政策仅针对我们控制的个人信息。您可能会通过第三方提交您的信息，他们会根据自身的独立隐私政策处理您的个人信息。我们对该等第三方如何处理您的个人信息概不负责。下文将
      帮您详细了解我们如何收集、使用、存储、传输、共享、转让（如适用）与保护个人信息；帮您了解查询、访问、删除、更正、撤回授权个人信息的方式。其中，有关您个人信息权益的条款重要内
      容我们已用加粗形式提示，请特别关注。
    </bm-card>
    <bm-card class="font-bold p-sm">
      一、我们如何收集和使用您的个人信息
    </bm-card>
    <bm-card class="indent-4">
      1.1我们根据合法、正当、必要的原则，仅收集所必要的信息。我们会按照如下方式收集您的个人信息，包括但不限于您在使用我们的服务时主动提供的、通过自动化手段收集的您在使用或接
      受服务中所产生的以及来自其他第三方的信息。
    </bm-card>
    <bm-card class="indent-4">
      1.2为提供更佳用户使用网站的体验，当您浏览该网站时，我们可能会记录您的浏览活动信息，这将是完全匿名化的。
    </bm-card>
    <bm-card class="indent-4">
      1.3我们收集的关于您对网站使用的信息。当您使用我们的网站时，我们会自动向您收集若干数据，包括IP地址、cookie收集的有关您对网站使用的信息、移动运营商（若适用）、时区设置、
      操作系统及平台以及有关您对网站使用的信息（如申请提交的时间、页面浏览历史、申请记录等）（下文简称“使用信息”）。
    </bm-card>

    <bm-card class="font-bold p-sm">
      二、我们如何使用Cookies和同类技术
    </bm-card>
    <bm-card class="indent-4">
      2.1我们采用cookie提升您在使用网站时的体验。Cookie是安装在您设备上的一些小文件，我们可以通过其提供特定特性和功能。网站会为内部流量监控、容量目的或网站管理目的检测和使
      用您的IP地址或域名。
    </bm-card>
    <bm-card class="indent-4">
      2.2我们仅使用绝对必需的cookie（即运营网站必需的cookie），例如，包括使您能够登录网站安全区域的cookie。 您可以在浏览器设置功能中进行相应的关闭cookies操作。 如您进行此操
      作，可能无法使用依赖于Cookies而提供的服务或相应功能。
    </bm-card>

    <bm-card class="font-bold p-sm">
      三、我们如何处理您的个人信息
    </bm-card>

    <bm-card class="indent-4">
      3.1我们不会转让您的个人信息给任何其他第三方，除非征得您的明确同意。随着我们业务的持续发展，我们有可能进行合并、收购、资产转让等交易。如若发生我们将告知您相关情形，按照
      法律法规及不低于本政策所要求的标准继续保护或要求接收方继续保护您的个人信息，否则我们将要求该接收方重新征得您的同意。
    </bm-card>
    <bm-card class="indent-4">
      3.2我们不会对外公开披露所收集的个人信息，如必须公开披露时，我们会向您告知此次公开披露的目的、披露信息的类型及可能涉及的敏感信息，并征得您的明示同意。 共享、转让、公开
      披露个人信息时事先征得授权同意的例外。另外，根据相关法律法规及国家标准，以下情形中，我们可能会共享、转让、公开披露个人信息无需事先征得您的授权同意：
    </bm-card>

    <bm-card class="indent-4">
      （1）与国家安全、国防安全直接相关的；
    </bm-card>

    <bm-card class="indent-4">
      （2）与公共安全、公共卫生、重大公共利益直接相关的；
    </bm-card>

    <bm-card class="indent-4">
      （3）与犯罪侦查、起诉、审判和判决执行等直接相关的；
    </bm-card>

    <bm-card class="indent-4">
      （4）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
    </bm-card>

    <bm-card class="indent-4">
      （5）个人信息主体自行向社会公众公开个人信息的；
    </bm-card>

    <bm-card class="indent-4">
      （6）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
    </bm-card>

    <bm-card class="font-bold p-sm">
      四、我们如何存储您的个人信息
    </bm-card>

    <bm-card class="indent-4">
      4.1我们会通过安全的方式存储您的信息，包括本地存储、数据库和服务器日志。 一般情况下，我们只会在为实现本政策第一部分所述目的所必需的最短时间内或法律、行政法规规定或您另行
      授权同意的条件/范围内存储您的个人信息。
    </bm-card>

    <bm-card class="indent-4">
      4.2一般情况下，我们会将境内收集的个人信息存储于中华人民共和国境内。除此之外，我们不会跨境传输或存储您的个人信息。将来如需跨境传输或存储的，我们会向您告知个人信息出境的
      目的、接收方、安全保证措施和安全风险，并征您的单独同意。此外根据国内法律、行政法规和相关监管部门的规定执行，通过签订协议、评估核查等有效措施，要求境外机构为所获得的您的个人
      信息保密。
    </bm-card>

    <bm-card class="font-bold p-sm">
      五、我们如何保障您的个人信息的安全
    </bm-card>
    <bm-card class="indent-4">
      5.1我们已使用符合业界标准的安全防护措施保护第三方开发者和/或终端用户提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损毁、泄漏或丢失。 我们采用业界领先
      的技术保护措施。我们使用的技术手段包括但不限于防火墙、加密（例如SSL）、去标识化或匿名化处理、访问控制措施等。此外，我们还会不断加强将SDK集成到第三方上的安全能力，以防未经
      授权的人员擅自访问、使用或披露用户的信息。
    </bm-card>
    <bm-card class="indent-4">
      5.2若发生个人信息泄露、损毁、丢失等安全事件，我们会启动应急预案，阻止安全事件扩大。安全事件发生后，我们会及时以推送通知、邮件等形式向您告知安全事件的基本情况、我们即将
      或已经采取的处置措施和补救措施，以及我们对您的应对建议。
    </bm-card>

    <bm-card class="indent-4">
      5.3您享有若干与我们持有的您的个人信息有关的权利。若要行使这些权利或对权利的行使有任何疑问，请通过电子邮件联络我们： info@lemutechnology.com。 在处理数据访问或更正请
      求时，我们会检查请求人的身份，以确保他/她是具有做出数据访问或更正请求的合法权利的人士。 我们会响应您的合理请求，如无端重复、技术无法实现或实现需要不合理的成本（例如，需要开
      发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁盘上存放的信息）的请求，我们可能会说明理由并予以拒绝。 在以下情形中，我们将无法响
      应您的请求：
    </bm-card>

    <bm-card class="indent-4">
      （1）与我们履行法律法规规定的义务相违背的；
    </bm-card>

    <bm-card class="indent-4">
      （2）危害国家安全、国防安全的；
    </bm-card>

    <bm-card class="indent-4">
      （3）危害公共安公共卫生、重大公共利益的；
    </bm-card>

    <bm-card class="indent-4">
      （4）影响犯罪侦查、起诉、审判和执行判决等的；
    </bm-card>

    <bm-card class="indent-4">
      （5）我们有充分证据表明第三方开发者和/或终端用户存在主观恶意或滥用权利的；
    </bm-card>
    <bm-card class="indent-4">
      （6）涉及商业秘密的；
    </bm-card>

    <bm-card class="indent-4">
      （7）响应第三方开发者和/或终端用户的请求将导致第三方开发者或其他个人、组织的合法权益受到严重损害的其他情形。
    </bm-card>

    <bm-card class="font-bold p-sm">
      六、本政策如何更新
    </bm-card>

    <bm-card class="indent-4">
      6.1为向您提供更好的服务以及随着门户网站的不断发展与变化，我们可能会适时对本政策进行修订。当本政策的条款发生变更时，我们会在版本更新时以 红点提示、网站公告等方式对您进
      行提示，并说明生效日期。我们提醒您经常进行核查，以查看本政策的任何更新或变动。 本政策是乐牧服务协议和隐私平台政策的重要组成部分。 如果您对本隐私政策或个人信息保护相关事宜有
      任何疑问或投诉、建议时，您可以通过以下方式与我们联系：
    </bm-card>
    <bm-card class="indent-4">
      （1） 将问题发送至 info@vlue.tech 。
    </bm-card>
    <bm-card class="indent-4">
      （2） 将您的问题邮寄至下列地址： 中国广东省深圳市南山区xxx 邮编：xxxxxx
    </bm-card>
    <bm-card class="indent-3">
      我们将尽快审核所涉问题，并在15个工作日或法律法规规定的期限内答复您的请求。
    </bm-card>
  </bm-card>
</template>

<script>
import { defineComponent } from 'vue'
import BmCard from './BmCard.vue'
export default defineComponent({
  name: 'PrivacyStatement',
  components: {
    BmCard
  }
})
</script>

<style scoped>

</style>