export const banksObj = {
  '01020000': {
    icon: 'ICBC',
    name: '中国工商银行'
  },
  '03010000': {
    icon: 'COMM',
    name: '中国交通银行'
  },
  '01050000': {
    icon: 'CCB',
    name: '中国建设银行',
  },
  '01040000': {
    icon: 'BOC',
    name: '中国银行'
  },
  '01030000': {
    icon: 'ABC',
    name: '中国农业银行'
  },
  '01000000': {
    icon: 'PSBC',
    name: '邮储储蓄银行'
  },
  '03060000': {
    icon: 'GDB',
    name: '广发银行'
  },
  '03170000': {
    icon: 'BOHAIB',
    name: '渤海银行'
  },
  '03110000': {
    icon: 'EGBANK',
    name: '恒丰银行'
  },
  '03100000': {
    icon: 'SPDB',
    name: '浦东发展银行'
  },
  '03160000': {
    icon: 'CZBANK',
    name: '浙商银行'
  },
  '03080000': {
    icon: 'CMB',
    name: '招商银行'
  },
  '03070000': {
    icon: 'SPABANK',
    name: '平安银行'
  },
  '03090000': {
    icon: 'CIB',
    name: '兴业银行'
  },
  '03050000': {
    icon: 'CMBC',
    name: '民生银行'
  },
  '03040000': {
    icon: 'HXBANK',
    name: '华夏银行'
  },
  '03030000': {
    icon: 'CEB',
    name: '光大银行'
  },
  '03020000': {
    icon: 'CITIC',
    name: '中信银行'
  },
  '05167030': {
    icon: 'ZYCBANK',
    name: '遵义市商业银行'
  },
  '05154680': {
    icon: 'DZBANK',
    name: '德州银行'
  },
  '05131410': {
    icon: 'BOCD',
    name: '承德银行'
  },
  '05083000': {
    icon: 'JSBANK',
    name: '江苏银行'
  },
  '05031680': {
    icon: 'JINCHB',
    name: '晋城银行'
  },
  '05007020': {
    icon: '六盘水市商业银行',
    name: '六盘水市商业银行'
  },
  '05171270': {
    icon: 'HDBANK',
    name: '邯郸银行'
  },
  '05253450': {
    icon: 'MTBANK',
    name: '浙江民泰商业银行'
  },
  '05342050': {
    icon: 'ORBANK',
    name: '鄂尔多斯银行'
  },
  '05326550': {
    icon: '自贡银行',
    name: '自贡银行'
  },
  '05303380': {
    icon: 'CZCB',
    name: '浙江稠州商业银行'
  },
  '05284630': {
    icon: '泰安银行',
    name: '泰安银行'
  },
  '05274550': {
    icon: '东营银行',
    name: '东营银行'
  },
  '05264330': {
    icon: 'SRBANK',
    name: '上饶银行'
  },
  '04974790': {
    icon: 'LSBANK',
    name: '莱商银行'
  },
  '04966730': {
    icon: '四川天府银行',
    name: '四川天府银行'
  },
  '04791920': {
    icon: 'BSB',
    name: '包商银行'
  },
  '04761430': {
    icon: '沧州银行',
    name: '沧州银行'
  },
  '04753360': {
    icon: '湖州银行',
    name: '湖州银行'
  },
  '04741910': {
    icon: 'H3CB',
    name: '内蒙古银行'
  },
  '04836560': {
    icon: '攀枝花市商业银行',
    name: '攀枝花市商业银行'
  },
  '04856590': {
    icon: '绵阳市商业银行',
    name: '绵阳市商业银行'
  },
  '04956140': {
    icon: '柳州银行',
    name: '柳州银行'
  },
  '04933160': {
    icon: '江苏长江商业银行',
    name: '江苏长江商业银行'
  },
  '04916170': {
    icon: 'GLBANK',
    name: '桂林银行'
  },
  '04901380': {
    icon: '张家口银行',
    name: '张家口银行'
  },
  '04895910': {
    icon: 'NYNB',
    name: '广东南粤银行'
  },
  '04871620': {
    icon: '大同银行',
    name: '大同银行'
  },
  '04866570': {
    icon: '泸州市商业银行',
    name: '泸州市商业银行'
  },
  '04733450': {
    icon: 'ZJTLCB',
    name: '浙江泰隆商业银行'
  },
  '05755200': {
    icon: 'HBC',
    name: '湖北银行'
  },
  '05734220': {
    icon: 'HBC',
    name: '景德镇商业银行'
  },
  '05722280': {
    icon: '营口沿海银行',
    name: '营口沿海银行'
  },
  '05705500': {
    icon: 'HRXJB',
    name: '华融湘江银行'
  },
  '05695150': {
    icon: 'XYBANK',
    name: '信阳银行'
  },
  '05684960': {
    icon: '安阳市商业银行',
    name: '安阳市商业银行'
  },
  '05870000': {
    icon: '厦门国际银行',
    name: '厦门国际银行'
  },
  '05864910': {
    icon: '中原银行',
    name: '中原银行'
  },
  '05847000': {
    icon: '贵州银行',
    name: '贵州银行'
  },
  '05818200': {
    icon: '甘肃银行',
    name: '甘肃银行'
  },
  '05646710': {
    icon: '宜宾市商业银行',
    name: '宜宾市商业银行'
  },
  '05492340': {
    // icon: 'BOCY',
    name: '朝阳银行'
  },
  '05484950': {
    icon: 'BOP',
    name: '平顶山银行'
  },
  '05478820': {
    icon: 'KLB',
    name: '昆仑银行'
  },
  '05438720': {
    icon: 'SZSBK',
    name: '石嘴山银行'
  },
  '05426900': {
    icon: 'CCQTGB',
    name: '重庆三峡银行'
  },
  '05417910': {
    icon: '长安银行',
    name: '	长安银行'
  },
  '05406650': {
    icon: 'LSCCB',
    name: '	乐山市商业银行'
  },
  '05521340': {
    icon: '保定银行',
    name: '	保定银行'
  },
  '05631650': {
    icon: '阳泉市商业银行',
    name: '	阳泉市商业银行'
  },
  '05625080': {
    // icon: 'BOZK',
    name: '	周口银行'
  },
  '05611480': {
    icon: 'HSBK',
    name: '	衡水银行'
  },
  '05605110': {
    icon: 'BZMD',
    name: '	驻马店银行'
  },
  '05591750': {
    icon: '晋中银行',
    name: '	晋中银行'
  },
  '05576750': {
    icon: '达州银行',
    name: '	达州银行'
  },
  '05565040': {
    icon: '漯河银行',
    name: '	漯河银行'
  },
  '05541310': {
    icon: 'XTB',
    name: '	邢台银行'
  },
  '05374610': {
    icon: 'JNBANK',
    name: '	济宁银行'
  },
  '04721460': {
    icon: 'LANGFB',
    name: '	廊坊银行'
  },
  '04256020': {
    icon: 'BOD',
    name: '	东莞银行'
  },
  '04202220': {
    icon: 'DLB',
    name: '	大连银行'
  },
  '04221210': {
    icon: 'BHB',
    name: '	河北银行'
  },
  '04233310': {
    icon: 'HZCB',
    name: '	杭州银行'
  },
  '04243010': {
    icon: 'NJCB',
    name: '	南京银行'
  },
  '04263380': {
    icon: 'JHBANK',
    name: '	金华银行'
  },
  '04283370': {
    icon: 'SXCB',
    name: '	绍兴银行'
  },
  '04296510': {
    icon: 'CDCB',
    name: '	成都银行'
  },
  '04302240': {
    icon: 'FSCB',
    name: '抚顺银行'
  },
  '04314730': {
    icon: 'LSBC',
    name: '临商银行'
  },
  '04325250': {
    icon: '宜昌市商业银行',
    name: '宜昌市商业银行'
  },
  '04341100': {
    icon: 'TCCB',
    name: '天津银行'
  },
  '04354910': {
    icon: 'ZZBANK',
    name: '郑州银行'
  },
  '04192310': {
    icon: '辽阳银行',
    name: '辽阳银行'
  },
  '04184930': {
    icon: 'LYBANK',
    name: '洛阳银行'
  },
  '04012900': {
    icon: 'SHBANK',
    name: '上海银行'
  },
  '04023930': {
    icon: '厦门银行',
    name: '厦门银行'
  },
  '04031000': {
    icon: 'BJBANK',
    name: '北京银行'
  },
  '04044560': {
    icon: '烟台银行',
    name: '烟台银行'
  },
  '04053910': {
    icon: 'FJHXBC',
    name: '福建海峡银行'
  },
  '04062410': {
    icon: 'JLBANK',
    name: '吉林银行'
  },
  '04083320': {
    icon: 'NBBANK',
    name: '宁波银行'
  },
  '04094510': {
    icon: 'QLBANK',
    name: '齐鲁银行'
  },
  '04123330': {
    icon: 'WZCB',
    name: '温州银行'
  },
  '04135810': {
    icon: 'GCB',
    name: '广州银行'
  },
  '04145210': {
    icon: 'HKB',
    name: '汉口银行'
  },
  '04162640': {
    icon: 'DAQINGB',
    name: '龙江银行'
  },
  '04172210': {
    icon: 'SJBANK',
    name: '盛京银行'
  },
  '04368710': {
    icon: 'NXBANK',
    name: '宁夏银行'
  },
  '04554770': {
    icon: '日照银行',
    name: '日照银行'
  },
  '04562230': {
    icon: 'ASCB',
    name: '鞍山银行'
  },
  '04571260': {
    icon: '秦皇岛银行',
    name: '秦皇岛银行'
  },
  '04588510': {
    icon: 'BOQH',
    name: '青海银行'
  },
  '04593450': {
    icon: 'TZCB',
    name: '台州银行'
  },
  '04615510': {
    icon: 'CSCB',
    name: '长沙银行'
  },
  '04624580': {
    icon: 'BANKWF',
    name: '潍坊银行'
  },
  '04634280': {
    icon: 'GZB',
    name: '赣州银行'
  },
  '04643970': {
    icon: '泉州银行',
    name: '泉州银行'
  },
  '04652280': {
    icon: 'BOYK',
    name: '营口银行'
  },
  '04672290': {
    icon: 'FXCB',
    name: '阜新银行'
  },
  '04703350': {
    icon: 'JXBANK',
    name: '嘉兴银行'
  },
  '04544240': {
    icon: 'JJBANK',
    name: '九江银行'
  },
  '04375850': {
    icon: '珠海华润银行',
    name: '珠海华润银行'
  },
  '04384530': {
    icon: 'ZBCB',
    name: '齐商银行'
  },
  '04392270': {
    icon: 'BOJZ',
    name: '锦州银行'
  },
  '04403600': {
    icon: 'HSBANK',
    name: '徽商银行'
  },
  '04416900': {
    icon: 'CQBANK',
    name: '重庆银行'
  },
  '04422610': {
    icon: '哈尔滨银行',
    name: '哈尔滨银行'
  },
  '04437010': {
    icon: '贵阳银行',
    name: '贵阳银行'
  },
  '04447910': {
    icon: 'XABANK',
    name: '西安银行'
  },
  '04504520': {
    icon: 'QDCCB',
    name: '青岛银行'
  },
  '04491610': {
    icon: 'JSB',
    name: '晋商银行'
  },
  '04484210': {
    icon: '江西银行',
    name: '江西银行'
  },
  '04478210': {
    icon: 'LZYH',
    name: '兰州银行'
  },
  '04462260': {
    icon: 'BODD',
    name: '丹东银行'
  },
  '05247410': {
    icon: '云南红塔银行',
    name: '云南红塔银行'
  },
  '14367000': {
    icon: '贵州省农村信用社联合社',
    name: '贵州省农村信用社联合社'
  },
  '14385500': {
    icon: '湖南省农村信用社联合社',
    name: '湖南省农村信用社联合社'
  },
  '14173900': {
    icon: '福建省农村信用社联合社',
    name: '福建省农村信用社联合社'
  },
  '14181000': {
    icon: 'BJRCB',
    name: '北京农村商业银行'
  },
  '14226510': {
    icon: '成都农村商业银行',
    name: '成都农村商业银行'
  },
  '14243000': {
    icon: '江苏省农村信用社联合社',
    name: '江苏省农村信用社联合社'
  },
  '14283054': {
    icon: '吴江农村商业银行',
    name: '吴江农村商业银行'
  },
  '14427900': {
    icon: '陕西省农村信用社联合社',
    name: '陕西省农村信用社联合社'
  },
  '14561100': {
    icon: '天津滨海农村商业银行',
    name: '天津滨海农村商业银行'
  },
  '14595210': {
    // icon: '武汉农村商业银行',
    name: '武汉农村商业银行'
  },
  '14486400': {
    icon: '海南省农村信用社联合社',
    name: '海南省农村信用社联合社'
  },
  '14538200': {
    icon: '甘肃省农村信用社联合社',
    name: '甘肃省农村信用社联合社'
  },
  '14156020': {
    icon: '东莞农村商业银行',
    name: '东莞农村商业银行'
  },
  '14012900': {
    icon: 'SHRCB',
    name: '上海农村商业银行'
  },
  '14023052': {
    icon: 'KSRB',
    name: '昆山农村商业银行'
  },
  '14033055': {
    icon: 'CSRCB',
    name: '常熟农村商业银行'
  },
  '14045840': {
    icon: 'SRCB',
    name: '深圳农村商业银行'
  },
  '14055810': {
    icon: '广州农村商业银行',
    name: '广州农村商业银行'
  },
  '14097300': {
    icon: '云南省农村信用社联合社',
    name: '云南省农村信用社联合社'
  },
  '14123022': {
    icon: 'JRCB',
    name: '江阴农村商业银行'
  },
  '14136900': {
    icon: 'CRCBANK',
    name: '重庆农村商业银行'
  },
  '05910000': {
    icon: '湖南三湘银行',
    name: '湖南三湘银行'
  },
  '03370000': {
    icon: '华商银行',
    name: '华商银行'
  },
  '03340000': {
    icon: '大华银行',
    name: '大华银行'
  },
  '03390000': {
    icon: '富邦华一银行',
    name: '富邦华一银行'
  },
  '03360000': {
    // icon: '企业银行',
    name: '企业银行'
  },
  '03350000': {
    icon: '大新银行',
    name: '大新银行'
  },
  '03330000': {
    icon: '法国兴业银行',
    name: '法国兴业银行'
  },
  '03320000': {
    icon: '南洋商业银行',
    name: '南洋商业银行'
  },
  '03310000': {
    icon: '永亨银行',
    name: '永亨银行'
  },
  '03190000': {
    icon: '花旗银行',
    name: '花旗银行'
  },
  '03200000': {
    icon: 'HKBEA',
    name: '东亚银行'
  },
  '03210000': {
    icon: '汇丰银行',
    name: '汇丰银行'
  },
  '03220000': {
    icon: '渣打银行',
    name: '渣打银行'
  },
  '03250000': {
    icon: '星展银行',
    name: '星展银行'
  },
  '03260000': {
    icon: '恒生银行',
    name: '恒生银行'
  },
  '03270000': {
    icon: '友利银行',
    name: '友利银行'
  },
  '03280000': {
    icon: '新韩银行',
    name: '新韩银行'
  },
  '03290000': {
    icon: 'HANABANK',
    name: '韩亚银行'
  },
  '03300000': {
    icon: '华侨银行',
    name: '华侨银行'
  },
  '03380000': {
    // icon: '中德住房储蓄银行',
    name: '中德住房储蓄银行'
  },
  'default': {
    icon: 'default',
    name: '未知银行'
  },
  '03240000': {
    // icon: '荷兰银行',
    name: '荷兰银行'
  },
  '03450000': {
    // icon: '玉山银行',
    name: '玉山银行'
  },
  '03460000': {
    // icon: 'CRCBANK',
    name: '重庆富民银行'
  },
  '03420000': {
    // icon: 'CRCBANK',
    name: '天津金城银行'
  },
  '03440000': {
    // icon: 'CRCBANK',
    name: '温州民商'
  },
  '03430000': {
    // icon: 'CRCBANK',
    name: '上海华瑞银行股份有限公司'
  },
  '03400000': {
    // icon: '深圳前海微众银行',
    name: '深圳前海微众银行'
  },
  '14144500': {
    // icon: '山东省农村信用社联合社',
    name: '山东省农村信用社联合社'
  },
  '14113030': {
    // icon: '徐州市市郊信用合作社联合社',
    name: '徐州市市郊信用合作社联合社'
  },
  '14105200': {
    // icon: '湖北省农村信用社联合社',
    name: '湖北省农村信用社联合社'
  },
  '14085883': {
    // icon: '佛山顺德农村商业银行',
    name: '佛山顺德农村商业银行'
  },
  '14075882': {
    // icon: '广东南海农村商业银行',
    name: '广东南海农村商业银行'
  },
  '14452400': {
    // icon: '吉林省农村信用社联合社',
    name: '吉林省农村信用社联合社'
  },
  '14722410': {
    // icon: '长春发展农村商业银行',
    name: '长春发展农村商业银行'
  },
  '14526500': {
    // icon: '四川省农村信用社联合社',
    name: '四川省农村信用社联合社'
  },
  '14511900': {
    // icon: '内蒙古自治区农村信用社联合社',
    name: '内蒙古自治区农村信用社联合社'
  },
  '14505800': {
    // icon: 'GDRCC',
    name: '广东省农村信用社联合社'
  },
  '14498500': {
    // icon: '青海省农村信用社联合社',
    name: '青海省农村信用社联合社'
  },
  '14473600': {
    // icon: '安徽省农村信用社联合社',
    name: '安徽省农村信用社联合社'
  },
  '14468700': {
    // icon: '宁夏黄河农村商业银行',
    name: '宁夏黄河农村商业银行'
  },
  '14542200': {
    // icon: '辽宁省农村信用社联合社',
    name: '辽宁省农村信用社联合社'
  },
  '14551600': {
    // icon: '山西省农村信用社联合社',
    name: '山西省农村信用社联合社'
  },
  '14712415': {
    // icon: '吉林九台农村商业银行',
    name: '吉林九台农村商业银行'
  },
  '14692610': {
    // icon: '哈尔滨农村商业银行',
    name: '哈尔滨农村商业银行'
  },
  '14636410': {
    // icon: '海口农村商业银行',
    name: '海口农村商业银行'
  },
  '14622220': {
    // icon: '大连农商行',
    name: '大连农商行'
  },
  '14616410': {
    // icon: '海口联合农村商业银行',
    name: '海口联合农村商业银行'
  },
  '14572600': {
    // icon: '黑龙江省农村信用社联合社',
    name: '黑龙江省农村信用社联合社'
  },
  '14448800': {
    // icon: '新疆维吾尔自治区农村信用社联合社',
    name: '新疆维吾尔自治区农村信用社联合社'
  },
  '14436100': {
    // icon: '广西壮族自治区农村信用社联合社',
    name: '广西壮族自治区农村信用社联合社'
  },
  '14215881': {
    // icon: 'BJRCB',
    name: '佛山市三水区农村信用合作社联合社'
  },
  '14203323': {
    // icon: 'BJRCB',
    name: '宁波鄞州农村合作银行'
  },
  '14191100': {
    // icon: '天津农村商业银行',
    name: '天津农村商业银行'
  },
  '14163056': {
    // icon: '湖南省农村信用社联合社',
    name: '张家港农村商业银行'
  },
  '14293300': {
    // icon: '浙江省农村信用社联合社',
    name: '浙江省农村信用社联合社'
  },
  '14315850': {
    // icon: '珠海市农村信用合作社联合社',
    name: '珠海市农村信用合作社联合社'
  },
  '14411200': {
    // icon: '河北省农村信用社联合社',
    name: '河北省农村信用社联合社'
  },
  '14404900': {
    // icon: '河南省农村信用社联合社',
    name: '河南省农村信用社联合社'
  },
  '14394200': {
    // icon: '湖南省农村信用社联合社',
    name: '江西省农村信用社联合社'
  },
  '14373020': {
    // icon: '贵州省农村信用社联合社',
    name: '江苏锡州农村商业银行'
  },
  '14341770': {
    // icon: '云南红塔银行',
    name: '山西尧都农村商业银行'
  },
  '14333051': {
    // icon: 'TCRCB',
    name: '江苏太仓农村商业银行'
  },
  '04523060': {
    // icon: '江西银行',
    name: '南通商业银行'
  },
  '04453020': {
    // icon: 'XABANK',
    name: '无锡市商业银行'
  },
  '04533120': {
    // icon: 'JJBANK',
    name: '扬州商业银行'
  },
  '04693080': {
    // icon: 'FXCB',
    name: '淮安市商业银行'
  },
  '04683040': {
    // icon: 'FXCB',
    name: '常州市商业银行'
  },
  '04667310': {
    // icon: 'BOYK',
    name: '昆明银行'
  },
  '04603110': {
    // icon: 'TZCB',
    name: '盐城商业银行'
  },
  '04713620': {
    // icon: 'NXBANK',
    name: '芜湖市商业银行'
  },
  '04115010': {
    // icon: 'QLBANK',
    name: '焦作银行'
  },
  '04073140': {
    // icon: 'JLBANK',
    name: '镇江市商业银行'
  },
  '04332360': {
    // icon: '宜昌市商业银行',
    name: '葫芦岛市商业银行'
  },
  '04278810': {
    // icon: 'JHBANK',
    name: '	乌鲁木齐银行'
  },
  '04213050': {
    // icon: 'DLB',
    name: '	苏州市商业银行'
  },
  '05556840': {
    // icon: '凉山州商业银行',
    name: '	凉山州商业银行'
  },
  '05516620': {
    // icon: 'LSCCB',
    name: '	遂宁银行'
  },
  '05503320': {
    // icon: 'LSCCB',
    name: '	宁波东海银行'
  },
  '05392330': {
    // icon: 'LSCCB',
    name: '	铁岭银行'
  },
  '05442320': {
    // icon: 'KLB',
    name: '盘锦银行'
  },
  '05666770': {
    // icon: '中原银行',
    name: '雅安市商业银行'
  },
  '05658880': {
    // icon: '贵州银行',
    name: '库尔勒银行'
  },
  '05803320': {
    // icon: '甘肃银行',
    name: '宁波通商银行'
  },
  '05824540': {
    // icon: '贵州银行',
    name: '枣庄银行'
  },
  '05832250': {
    // icon: '贵州银行',
    name: '本溪市商业银行'
  },
  '05675060': {
    // icon: 'HBC',
    name: '商丘市商业银行'
  },
  '05778980': {
    // icon: 'HBC',
    name: '新疆汇和银行'
  },
  '05785800': {
    // icon: 'HBC',
    name: '华兴银行'
  },
  '05795020': {
    // icon: 'HBC',
    name: '濮阳市商业银行'
  },
  '05886400': {
    // icon: 'HBC',
    name: '海南银行'
  },
  '05748840': {
    // icon: 'HBC',
    name: '哈密商行'
  },
  '05767700': {
    // icon: 'ZJTLCB',
    name: '西藏银行'
  },
  '05908810': {
    // icon: 'ZJTLCB',
    name: '新疆银行'
  },
  '04885050': {
    // icon: 'NYNB',
    name: '三门峡市城市信用社'
  },
  '04943030': {
    // icon: '柳州银行',
    name: '徐州市商业银行'
  },
  '04843680': {
    // icon: '安庆市商业银行',
    name: '安庆市商业银行'
  },
  '04773650': {
    // icon: 'BSB',
    name: '马鞍山市商业银行'
  },
  '04786110': {
    // icon: 'BSB',
    name: '南宁市商业银行'
  },
  '04803070': {
    // icon: '四川天府银行',
    name: '连云港市商业银行'
  },
  '04814650': {
    // icon: '四川天府银行',
    name: '威海商业银行'
  },
  '04823600': {
    // icon: '四川天府银行',
    name: '淮北市商业银行'
  },
  '05365030': {
    // icon: 'SRBANK',
    name: '许昌市商业银行'
  },
  '05295280': {
    // icon: 'CZCB',
    name: '襄樊市商业银行'
  },
  '05311930': {
    // icon: '自贡银行',
    name: '乌海银行'
  },
  '05354970': {
    // icon: 'MTBANK',
    name: '鹤壁银行'
  },
  '05238333': {
    // icon: 'HDBANK',
    name: '平凉市商业银行'
  },
  '04986580': {
    // icon: '六盘水市商业银行',
    name: '长城华西银行'
  },
  '04991240': {
    // icon: '六盘水市商业银行',
    name: '唐山银行'
  },
  '05027360': {
    // icon: 'JINCHB',
    name: '曲靖市商业银行'
  },
  '05121660': {
    // icon: 'BOCD',
    name: '长治银行'
  },
}